# Nama : M. Irsyadul. Asyrof

# Nim : 2109106047

## Import Library

In [33]:
import pandas as pd

In [34]:
import numpy as np

In [55]:
df = pd.read_csv("dataset.csv")

## Memasukkan ke dalam dictionary

In [ ]:
info = {
  'total_records': 0,
  'atribut': [],
  'object': 0,
  'number': 0,
  'null': 0
}

info['total_records'] = df.shape[0]
info['atribut'] = list(df.columns.values)
info['null_atr'] = list(df.loc[:, df.isnull().any()].columns)
info['object_atr'] = list(df.select_dtypes(['object']).columns)
info['number_atr'] = list(df.select_dtypes(['float64', 'int64']).columns)

## Jumlah Record

In [57]:
print ("Jumlah Record :", info['total_records'] )

Jumlah Record : 16671

## Nama Atribut Dan Jumlahnya

In [38]:
print ("Nama Atribut:", info['atribut'])
print ("Jumlah Atribut :", len(info['atribut']))

Nama Atribut: ['lat', 'lon', 'alt', 'is_broken', 'is_active', 'dot', 'state', 'city', 'street', 'country', 'last_checked']
Jumlah Atribut : 11

In [39]:
print ("Jumlah Atribut dengan Tipe Objek :", info['object_atr'], "Berjumlah",len(info['object_atr']), "Atribut")

Jumlah Atribut dengan Tipe Objek : ['dot', 'state', 'city', 'street', 'country', 'last_checked'] Berjumlah 6 Atribut

In [58]:
print ("Jumlah Attribute dengan Tipe Angka :", info['number_atr'], "Berjumlah", len(info['number_atr']),"Atribut")

Jumlah Attribute dengan Tipe Angka : ['lat', 'lon', 'alt'] Berjumlah 3 Atribut

## Jumlah Atribut Bernilai NULL

In [59]:
print ("Jumlah Attribute yang Memiliki Nilai Null :", info['null_atr'], "Berjumlah", len(info['null_atr']), "Atribut")

Jumlah Attribute yang Memiliki Nilai Null : ['state', 'city'] Berjumlah 2 Atribut

## Rata-Rata, Standar Deviasi, Nilai Minimum, Nilai Maksimum, Q1, Q2, dan Q3 Dari Attribute Bertipe Angka.

In [42]:
df.describe()

                lat           lon      alt
count  16671.000000  16671.000000  16671.0
mean     -76.600800     40.406232      0.0
std       37.309030      7.250517      0.0
min     -159.368738     19.517590      0.0
25%      -95.572842     34.927834      0.0
50%      -83.780231     40.213555      0.0
75%      -75.261739     44.860442      0.0
max       14.968594     64.859406      0.0

# Nilai Korelasi Dari Atribut Bertipe Angka

In [45]:
df.corr()

C:\Users\1\AppData\Local\Temp\ipykernel_14956\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

                lat       lon  alt  is_broken  is_active
lat        1.000000  0.621523  NaN   0.056694   0.005385
lon        0.621523  1.000000  NaN   0.021749   0.056888
alt             NaN       NaN  NaN        NaN        NaN
is_broken  0.056694  0.021749  NaN   1.000000   0.049452
is_active  0.005385  0.056888  NaN   0.049452   1.000000

# Merubah Bilangan Bulat Ke Desimal

### Sebelum Atribut "alt" Diubah

In [46]:
df.dtypes

lat             float64
lon             float64
alt               int64
is_broken          bool
is_active          bool
dot              object
state            object
city             object
street           object
country          object
last_checked     object
dtype: object

### Setelah Atribut "alt" Diubah

In [50]:
df['alt'] = df['alt'].astype('float64')
df.dtypes

lat             float64
lon             float64
alt             float64
is_broken          bool
is_active          bool
dot              object
state            object
city             object
street           object
country          object
last_checked     object
dtype: object

# 10 Record Pertama Ber Atribut Angka

In [54]:
dh = df.select_dtypes(include=np.number)
dh.head(10)

         lat        lon  alt
0 -73.988281  40.718830    0
1 -74.005090  40.728794    0
2 -73.993408  40.729197    0
3 -73.985855  40.726555    0
4 -73.991692  40.691383    0
5 -73.982277  40.731014    0
6 -73.996726  40.737864    0
7 -73.990517  40.736977    0
8 -74.038700  40.726501    0
9 -74.043057  40.719843    0

In [63]:
df[['lat','lon','alt']].to_csv("angka.csv")